## :white_check_mark: Terraform Plan Successful

| :clock1: Last Updated | :bust_in_silhouette: Triggered By | :link: Workflow |
|:--:|:--:|:--:|
| `2026-01-12 12:09:55 UTC` | @AshleyHollis | [View Run](https://github.com/AshleyHollis/yt-summarizer/actions/runs/20918813888) |

### Resource Changes

| Action | Count |
|:-------|------:|
| :green_circle: **Add** | 8 |
| :yellow_circle: **Change** | 7 |
| :red_circle: **Destroy** | 1 |

---

### :heavy_plus_sign: Resources to Create (8)

<details>
<summary>:heavy_plus_sign: <code>module.github_oidc.azuread_application.github_actions</code></summary>

```hcl
  + resource "azuread_application" "github_actions" {
  + app_role_ids                = (known after apply)
  + client_id                   = (known after apply)
  + disabled_by_microsoft       = (known after apply)
  + display_name                = "github-actions-yt-summarizer"
  + id                          = (known after apply)
  + logo_url                    = (known after apply)
  + oauth2_permission_scope_ids = (known after apply)
  + object_id                   = (known after apply)
  + owners                      = [
      + "0a8480bd-2b41-449f-b16e-badd5616ae15",
  + prevent_duplicate_names     = false
  + publisher_domain            = (known after apply)
  + sign_in_audience            = "AzureADMyOrg"
  + tags                        = [
      + "Environment:prod",
      + "ManagedBy:terraform",
      + "Project:yt-summarizer",
  + template_id                 = (known after apply)
```

</details>
<details>
<summary>:heavy_plus_sign: <code>module.github_oidc.azuread_application_federated_identity_credential.main</code></summary>

```hcl
  + resource "azuread_application_federated_identity_credential" "main" {
  + application_id = (known after apply)
  + audiences      = [
      + "api://AzureADTokenExchange",
  + credential_id  = (known after apply)
  + description    = "Federated credential for GitHub Actions on main branch"
  + display_name   = "github-main"
  + id             = (known after apply)
  + issuer         = "https://token.actions.githubusercontent.com"
  + subject        = "repo:AshleyHollis/yt-summarizer:ref:refs/heads/main"
```

</details>
<details>
<summary>:heavy_plus_sign: <code>module.github_oidc.azuread_application_federated_identity_credential.production</code></summary>

```hcl
  + resource "azuread_application_federated_identity_credential" "production" {
  + application_id = (known after apply)
  + audiences      = [
      + "api://AzureADTokenExchange",
  + credential_id  = (known after apply)
  + description    = "Federated credential for GitHub Actions production environment"
  + display_name   = "github-env-production"
  + id             = (known after apply)
  + issuer         = "https://token.actions.githubusercontent.com"
  + subject        = "repo:AshleyHollis/yt-summarizer:environment:production"
```

</details>
<details>
<summary>:heavy_plus_sign: <code>module.github_oidc.azuread_application_federated_identity_credential.pull_request</code></summary>

```hcl
  + resource "azuread_application_federated_identity_credential" "pull_request" {
  + application_id = (known after apply)
  + audiences      = [
      + "api://AzureADTokenExchange",
  + credential_id  = (known after apply)
  + description    = "Federated credential for GitHub Actions pull requests"
  + display_name   = "github-pr"
  + id             = (known after apply)
  + issuer         = "https://token.actions.githubusercontent.com"
  + subject        = "repo:AshleyHollis/yt-summarizer:pull_request"
```

</details>
<details>
<summary>:heavy_plus_sign: <code>module.github_oidc.azuread_application_federated_identity_credential.repository</code></summary>

```hcl
  + resource "azuread_application_federated_identity_credential" "repository" {
  + application_id = (known after apply)
  + audiences      = [
      + "api://AzureADTokenExchange",
  + credential_id  = (known after apply)
  + description    = "Federated credential for any GitHub Actions workflow in repository"
  + display_name   = "github-repo"
  + id             = (known after apply)
  + issuer         = "https://token.actions.githubusercontent.com"
  + subject        = "repo:AshleyHollis/yt-summarizer"
```

</details>
<details>
<summary>:heavy_plus_sign: <code>module.github_oidc.azuread_service_principal.github_actions</code></summary>

```hcl
  + resource "azuread_service_principal" "github_actions" {
  + account_enabled             = true
  + app_role_ids                = (known after apply)
  + app_roles                   = (known after apply)
  + application_tenant_id       = (known after apply)
  + client_id                   = (known after apply)
  + display_name                = (known after apply)
  + homepage_url                = (known after apply)
  + id                          = (known after apply)
  + logout_url                  = (known after apply)
  + oauth2_permission_scope_ids = (known after apply)
  + oauth2_permission_scopes    = (known after apply)
  + object_id                   = (known after apply)
  + owners                      = [
      + "0a8480bd-2b41-449f-b16e-badd5616ae15",
  + redirect_uris               = (known after apply)
  + saml_metadata_url           = (known after apply)
  + service_principal_names     = (known after apply)
  + sign_in_audience            = (known after apply)
  + tags                        = (known after apply)
  + type                        = (known after apply)
```

</details>
<details>
<summary>:heavy_plus_sign: <code>module.github_oidc.azurerm_role_assignment.acr_push[0]</code></summary>

```hcl
  + resource "azurerm_role_assignment" "acr_push" {
  + condition_version                = (known after apply)
  + id                               = (known after apply)
  + name                             = (known after apply)
  + principal_id                     = (known after apply)
  + principal_type                   = (known after apply)
  + role_definition_id               = (known after apply)
  + role_definition_name             = "AcrPush"
  + scope                            = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.ContainerRegistry/registries/acrytsummprd"
  + skip_service_principal_aad_check = (known after apply)
```

</details>
<details>
<summary>:heavy_plus_sign: <code>module.github_oidc.azurerm_role_assignment.contributor[0]</code></summary>

```hcl
  + resource "azurerm_role_assignment" "contributor" {
  + condition_version                = (known after apply)
  + id                               = (known after apply)
  + name                             = (known after apply)
  + principal_id                     = (known after apply)
  + principal_type                   = (known after apply)
  + role_definition_id               = (known after apply)
  + role_definition_name             = "Contributor"
  + scope                            = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd"
  + skip_service_principal_aad_check = (known after apply)
```

</details>

### :arrows_counterclockwise: Resources to Update (7)

<details>
<summary>:arrows_counterclockwise: <code>module.acr.azurerm_container_registry.acr</code></summary>

```hcl
  ~ resource "azurerm_container_registry" "acr" {
    # (17 unchanged attributes hidden)
```

</details>
<details>
<summary>:arrows_counterclockwise: <code>module.aks.azurerm_kubernetes_cluster.aks</code></summary>

```hcl
  ~ resource "azurerm_kubernetes_cluster" "aks" {
    # (29 unchanged attributes hidden)
  ~ default_node_pool {
      ~ os_disk_size_gb              = 128 -> 30
        # (19 unchanged attributes hidden)
        # (1 unchanged block hidden)
    # (6 unchanged blocks hidden)
```

</details>
<details>
<summary>:arrows_counterclockwise: <code>module.key_vault.azurerm_key_vault_secret.secrets["sql-connection-string"]</code></summary>

```hcl
  ~ resource "azurerm_key_vault_secret" "secrets" {
  ~ tags                    = {
      - "file-encoding" = "utf-8" -> null
  ~ value                   = (sensitive value)
    # (6 unchanged attributes hidden)
```

</details>
<details>
<summary>:arrows_counterclockwise: <code>module.sql.azurerm_mssql_database.database</code></summary>

```hcl
  ~ resource "azurerm_mssql_database" "database" {
    # (16 unchanged attributes hidden)
    # (3 unchanged blocks hidden)
```

</details>
<details>
<summary>:arrows_counterclockwise: <code>module.sql.azurerm_mssql_server.server</code></summary>

```hcl
  ~ resource "azurerm_mssql_server" "server" {
  ~ administrator_login_password             = (sensitive value)
    # (12 unchanged attributes hidden)
```

</details>
<details>
<summary>:arrows_counterclockwise: <code>module.storage.azurerm_storage_account.storage</code></summary>

```hcl
  ~ resource "azurerm_storage_account" "storage" {
    # (41 unchanged attributes hidden)
    # (3 unchanged blocks hidden)
```

</details>
<details>
<summary>:arrows_counterclockwise: <code>module.swa.azurerm_static_web_app.swa</code></summary>

```hcl
  ~ resource "azurerm_static_web_app" "swa" {
    # (10 unchanged attributes hidden)
  + github_oidc_application_id        = (known after apply)
  + github_oidc_federated_credentials = {
  + main         = "repo:AshleyHollis/yt-summarizer:ref:refs/heads/main"
  + production   = "repo:AshleyHollis/yt-summarizer:environment:production"
  + pull_request = "repo:AshleyHollis/yt-summarizer:pull_request"
  + repository   = "repo:AshleyHollis/yt-summarizer"
  + github_oidc_secrets               = {
  + AZURE_CLIENT_ID       = (known after apply)
  + AZURE_SUBSCRIPTION_ID = "28aefbe7-e2af-4b4a-9ce1-92d6672c31bd"
  + AZURE_TENANT_ID       = "c2d723a2-474e-44d2-a37c-9b4e9cb823d4"
  + github_oidc_subscription_id       = "28aefbe7-e2af-4b4a-9ce1-92d6672c31bd"
  + github_oidc_tenant_id             = "c2d723a2-474e-44d2-a37c-9b4e9cb823d4"
  ~ post_deploy_instructions          = <<-EOT
```

</details>

### :wastebasket: Resources to Destroy (1)

<details>
<summary>:wastebasket: <code>module.key_vault.azurerm_role_assignment.secrets_officer[0]</code></summary>

```hcl
  # (because index [0] is out of range for count)
  # (moved from module.key_vault.azurerm_role_assignment.secrets_officer)
  - resource "azurerm_role_assignment" "secrets_officer" {
  - id                   = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.KeyVault/vaults/kv-ytsumm-prd/providers/Microsoft.Authorization/roleAssignments/fde6c717-0024-8ad6-efd0-ce353b6928f3" -> null
  - name                 = "fde6c717-0024-8ad6-efd0-ce353b6928f3" -> null
  - principal_id         = "eac9556a-cd81-431f-a1ec-d6940b2d92d3" -> null
  - principal_type       = "User" -> null
  - role_definition_id   = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> null
  - role_definition_name = "Key Vault Secrets Officer" -> null
  - scope                = "/subscriptions/28aefbe7-e2af-4b4a-9ce1-92d6672c31bd/resourceGroups/rg-ytsumm-prd/providers/Microsoft.KeyVault/vaults/kv-ytsumm-prd" -> null
```

</details>
